# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [-10, 10, 2, 3, 4, 5,7 , 8, 9, 0, 5]
print(sum(numbers))
